/*
Вариант 36
Из входного потока вводится непрямоугольная  матрица целых чисел [Aij], i=1...m; j=1...n.
Значения m и ni заранее неизвестны и вводятся из входного потока.
Сформировать вектор, упорядочив по возрастанию значения той строки матрицы, в которой сумма 
элементов максимальна. Если таких строк несколько , упорядочить одну(любую) строку.
В дополнительных функциях доступ к элементам массивов реализовать с омощью указателей.
Исходную и полученную матрицы вывести в выходной поток с необходимыми комментариями.
*/
